[
  {
    "speaker" : "Vasily",
    "text" : "Да, я тебе скину, чувак рассказывает, как курсор использовать как личный персональную операционную систему.",
    "timestamp" : "00:00-00:11"
  },
  {
    "timestamp" : "00:00-00:00",
    "speaker" : "Speaker 1",
    "text" : "Задержка была."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "00:14-00:18",
    "text" : "То есть он не для программирования, личный суперагент."
  },
  {
    "text" : "Окей.",
    "timestamp" : "00:15-00:15",
    "speaker" : "Speaker 2"
  },
  {
    "text" : "Угу, угу.",
    "timestamp" : "00:18-00:18",
    "speaker" : "Speaker 2"
  },
  {
    "timestamp" : "00:21-00:24",
    "text" : "То есть у него есть доступ к папкам через...",
    "speaker" : "Vasily"
  },
  {
    "text" : "Да, он контекст сможет.",
    "timestamp" : "00:24-00:26",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 2",
    "timestamp" : "00:26-00:27",
    "text" : "Mm-hmm."
  },
  {
    "text" : "Да, у него доступ к папкам через эту командную строку.",
    "timestamp" : "00:28-00:33",
    "speaker" : "Vasily"
  },
  {
    "text" : "И он может там создавать файлы, удалять файлы, записывать всю фигню, лезть в интернет, потом еще что-то делать.",
    "timestamp" : "00:35-00:43",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "00:44-01:00",
    "text" : "И чувак реально, вот ты с чатом GPT общаешься в окошке или там с дипсиком, А тут, ну, и новое окошко, заново задаешь контекст.",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "01:01-02:32",
    "speaker" : "Vasily",
    "text" : "А тут чувак в курсе всего контекста, и ты с ним просто общаешься, он создает там какие-то, допустим, папка «Мое здоровье», и он туда все результаты анализов, допустим, складывает, и потом ты можешь спросить, какие у меня там параметры по здоровью, что ты рекомендуешь или какое лечение я проходил какие антибиотики у меня там не назначали вот такие штуки прикинь да я очень хочу прямо запустить сейчас немножко это ну понимаю ну ты это береги себя в нашем возрасте мужик нужно да и не штек и на тропил рекомендую да это на троп очень мощный мне как и сдвгшник у он был вообще просто божественно полезен."
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "01:11-01:12"
  },
  {
    "timestamp" : "01:30-01:31",
    "text" : "прикольно",
    "speaker" : "Speaker 4"
  },
  {
    "timestamp" : "01:37-02:26",
    "speaker" : "Speaker 3",
    "text" : "на у меня тоже сейчас план буран на три месяца там вообще не просто даже полчаса свободных особо не Так вот я там выцарапал себе два часа на бег в неделю, плюс у меня и работаю 25+5 по помодоро, вот и пятиминутки у меня почти все ЛФП. Вот поэтому я так за собой стяжу. Плюс сейчас хочу на этот период закинуться всякими креатином коллагеном финотропил, сейчас себе запишу, надо посмотреть что такое, как он со мной будет работать ему."
  },
  {
    "speaker" : "Vasily",
    "text" : "Реально очень многим ему обязан.",
    "timestamp" : "02:33-02:35"
  },
  {
    "timestamp" : "02:35-02:37",
    "text" : "А его продают бизнес-труб без это?",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "Без рецепта, да.",
    "speaker" : "Vasily",
    "timestamp" : "02:37-02:38"
  },
  {
    "text" : "to jest ok слушая у него нет этой он же этот он навичча он антидепрессант типа считается а он у него нет накопитель накопительного эффекта но у него есть но у него есть инструкции как бы что с этим справляется Ну посмотрим.",
    "timestamp" : "02:37-03:57",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Vasily",
    "text" : "Вот, но это наотропил со спидухой, короче, смешанный. Его для космонавтов сделали.",
    "timestamp" : "02:41-02:45"
  },
  {
    "speaker" : "Vasily",
    "text" : "Ну, он...",
    "timestamp" : "02:46-02:47"
  },
  {
    "text" : "Ну, поскольку ты его никогда не пил, там, наверное, нужно будет пропить курс. Типа одну таблетку утром выпиваешь там в курсе написано две таблетки но это не знаю меня как хомячка разорвет просто нет он не антидепрессант нет он не антидепрессант но он не относится к антидепрессантам он накопительный эффект у него есть и поэтому его курсами принимают но в отличие от перцетама он ну перцетам нужно месяц пить чтобы почувствовать эффект фенотропил с первой же таблетки буквально ты с бодуна просыпаешься съедаешь фенотропилы и как будто очки были заляпаны ты их протер и я душ холодной воде принимаю я помню твоя мама обливалась мама тоже вроде обливалась ну просто нас твоя мама звала обливаться ну да ну вот я принимаю душ холодный прям вообще не включаю горячую и зимой это и бать челлендж да давай знаешь чего давай поймем смотри давай раскидаем во первых по задачкам у у меня есть я я сейчас хочу за заходить этого я вот обрисовал логику как выглядит worker я кстати настроил redis то есть да оказывается он там был подключен его просто нужно было с пустым креденшалом настроить и все работа у меня техподдержка помогла ну вот соответственно новая задача или апдейт лочит задачу подгружает контекст в redis и и дальше запускается цикл дальше запускается цикл и вот этот цикл я сейчас настраиваю а давай да Угу.",
    "timestamp" : "02:51-06:41",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "03:57-03:59",
    "text" : "Я еще сейчас обливаться начал."
  },
  {
    "text" : "Ну не сейчас уже, три месяца.",
    "speaker" : "Speaker 3",
    "timestamp" : "04:00-04:02"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "04:05-04:09",
    "text" : "Ну холодно, да. Но я на зиму себе настраиваю, что я с ведром буду ходить на улицу."
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "04:13-04:14",
    "text" : "Папа, да."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Мама тоже, но папа дольше, и мы с ним родили.",
    "timestamp" : "04:15-04:19"
  },
  {
    "timestamp" : "04:20-04:21",
    "text" : "Ну короче, я дошел до этой же стадии.",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "04:22-04:23",
    "text" : "Мне тоже надо."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "ну да нет мы там все к себе как бы потом просто все подзабили получается три месяца уже обливаюсь и ну холодный душ и плюс когда в горах был это речки горные были каждого утра там купались и сейчас готовлю себя психологически потому что зимой я тоже это буду делать только уже более экстремальных Да, в этом и прикольно.",
    "timestamp" : "04:26-04:57"
  },
  {
    "text" : "Ну что, давай пособжим.",
    "timestamp" : "05:00-05:01",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "05:01-05:02",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Speaker 5",
    "text" : "Важуха.",
    "timestamp" : "05:35-05:36"
  },
  {
    "timestamp" : "05:45-05:45",
    "text" : "Угу.",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "Угу.",
    "speaker" : "Speaker 3",
    "timestamp" : "05:45-05:46"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "05:46-05:46",
    "text" : "Угу."
  },
  {
    "text" : "Угу.",
    "speaker" : "Speaker 3",
    "timestamp" : "05:47-05:47"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Я помню, що 8N був, якби є на бортному радису, который из которого он заменил.",
    "timestamp" : "05:48-05:56"
  },
  {
    "text" : "короче смотри я тебе чуть-чуть пока это все что с префиксом нижнее подчеркивание это сабворкеры то есть я их таким образом размечаю ну и с префиксом sync получается это все что связано с синхронизацией базы ну коду коду to base и есть основной там процесс он называется наверх там прокрутишь он там кода to base sync main он же позначен и вот это основной синхронизатор который короче, по которой крутит все остальные синхронизаторы, сабворкеры вернее, вот эти с prefix.",
    "speaker" : "Speaker 3",
    "timestamp" : "06:26-07:00"
  },
  {
    "timestamp" : "06:52-06:52",
    "speaker" : "Vasily",
    "text" : "Угу."
  },
  {
    "text" : "давай давай их тегами какими-нибудь обозначим Угу.",
    "speaker" : "Vasily",
    "timestamp" : "06:58-07:32"
  },
  {
    "timestamp" : "07:02-08:20",
    "speaker" : "Speaker 3",
    "text" : "Можно затегать, да, я пока не стал это делать, можешь сделать, я потом буду, подхвачу, как бы, другие тоже тегать. Там еще их до хрена, как бы я сделал из, получается, раз два три четырех четыре вернее из 4 5 6 7 8 9 10 задач короче будет еще вот собор киров это как бы полностью нас обеспечит нас с актуальными данными в базе вот и я там сделал вот этот error workflow handler он в общем будет отправлять не в случае падений основного воркера основного то такой то бейс будет не отправлять телегу сообщение вот У него горизонт только на две пока."
  },
  {
    "text" : "Окей, кайф.",
    "timestamp" : "07:38-07:39",
    "speaker" : "Vasily"
  },
  {
    "text" : "кайф давай поймем сейчас с точки зрения с точки зрения задач что нам нужно сделать у нас да вот давай я просто обрисую отчетность по, желтенькая это цель, по объектам управления темой формируется в боте через бот да вот так вот то есть отчетность по объектам управления формируется через бот планерки проходят по системе ну я такую лесенку цели делаю планировки в компании проходят по системе и где-то здесь четность по ходу исполнения здесь очень вопросительных знаков потому что я пока еще не проработал это планерки у села по все менеджеры вот так вот не во всей компании все плагерки на планерки усил вот это наши бизнесовые цели то есть чем мы должны добиться мы сейчас бежим к тому чтобы настроить отчетность в пилотном периметре.",
    "timestamp" : "07:53-10:45",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Okay.",
    "timestamp" : "08:33-08:34"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "09:14-09:14",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "09:32-09:32"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Speaker 2",
    "timestamp" : "09:34-09:34"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "10:09-10:10",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "10:47-10:47"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "10:52-11:27",
    "text" : "Для того, чтобы в пилотном периметре проходили, вот именно сбор отчетностей мы сейчас сделаем, для того, чтобы в пилотном периметре проходили планерки, Нам нужно еще сделать, бот помогает выделить, помогает проработать целеполагание проектов."
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "10:59-11:01",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "11:28-11:31",
    "text" : "То есть они должны завести какую-то нехуйню туда."
  },
  {
    "text" : "Gracias.",
    "timestamp" : "11:30-11:31",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "11:33-11:33"
  },
  {
    "speaker" : "Vasily",
    "text" : "У меня сейчас это есть, но это на платформе должно быть сделано.",
    "timestamp" : "11:34-11:39"
  },
  {
    "speaker" : "Vasily",
    "text" : "У меня сейчас в чате в шпите это промтом сделано.",
    "timestamp" : "11:39-11:41"
  },
  {
    "timestamp" : "11:43-11:43",
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "11:43-11:45",
    "text" : "И что еще?"
  },
  {
    "timestamp" : "11:46-11:47",
    "speaker" : "Vasily",
    "text" : "Сейчас, сейчас, сейчас, сейчас, сейчас."
  },
  {
    "speaker" : "Vasily",
    "text" : "Только что была мысль.",
    "timestamp" : "11:48-11:49"
  },
  {
    "speaker" : "Vasily",
    "text" : "Отчетность формируется через бот.",
    "timestamp" : "11:56-11:58"
  },
  {
    "timestamp" : "11:59-12:01",
    "speaker" : "Vasily",
    "text" : "Бот помогает с целеполаганием."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "12:05-15:31",
    "text" : "ладно пока этого хватит вот дальше для того чтобы это сделать нам нужно компоненты системы середине ким сделаем готов я называю эту штуку то скрекер для агентов это скрощен и настроена кода и еще проведено внедрение это организационные мероприятия то есть я должен обучить еще народ более или менее а до парсинг протоколов нам нужен точно вот уколов вот партинг протоколов нам нужен все право то колы парсятся в систему вот мы сейчас фокусированы на этом это наш и сейчас мы пилим вот эту штуку кода ну там более-менее все схвачено я ее настраиваю просто для вдохновения души знаешь я люблю с ней возиться это как лего собирать соответственно вот это наш фокус теперь какие компоненты этого task tracker которые нам нужны приемка сообщений worker отправка сообщений Так, сделаем."
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "12:41-12:41",
    "speaker" : "Speaker 2"
  },
  {
    "text" : "ну это на это как бы чуть ли и не было Sim.",
    "timestamp" : "13:26-14:54",
    "speaker" : "Speaker 1"
  },
  {
    "timestamp" : "15:38-15:38",
    "speaker" : "Vasily",
    "text" : "Давай подумаем."
  },
  {
    "timestamp" : "15:49-15:50",
    "text" : "Ну, вроде да.",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "15:53-15:53",
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Vasily",
    "text" : "А, да.",
    "timestamp" : "16:00-16:01"
  },
  {
    "timestamp" : "16:10-24:26",
    "text" : "настроен и отработан процесс создания описания процесса вот это еще важно то есть не вот эта штука то есть я кстати пока писал техподдержку я сформулировал кратко как наш агент работает по большому счету этот цикл то есть наш workflow это исполнение цикла вот начало цикла вот ну ладно тут немного другое деление короче в worker это по сути цикличная херь и каждый цикл выполняет какую-то работу принимая на вход информацию и выдавая информацию обработанную по итогам цикла соответственно нам вот это вот инфраструктурная обвязка давай раз уж мы начали описать то модель данных проекта в бд это то что ты сейчас пилишь она по большому счету вот со всем этим связан вот а воркер это просто исполнение цикла давай подумаем есть ли что-то что еще мы забыли не да вот на это на этом уровне мы сейчас пойдем вглубь вот на этом уровне если принципиальные элементы схемы которые мы забыли давай ну давай вернемся давай вернемся к customer journey map там приблизительно какому-то писанию сценария ну я понял что это уже нужно переделать но логика такая примерно короче то есть а дальше знаешь что нужно очень хорошо что мы это сделали еще отправка сообщений еще нет сейчас как это ломитр гер хрон это наверное мелковато если у тебя триггерит от этого триггера да так получить список пользователей короче есть но наверное эта часть worker формирование контекста вот формирование контекста это капец важное дерьмо но он у наверно внутри воркера все-таки я вот про это думаю да да правит запрос отчета а еще знаешь что нужно еще нужно витрины для пользователей то что я делаю по типу до 3 почему я называют витрины то что она не интерактивная ну да да да по аналогии с витриной данных я полез тут ты кстати умеешь в лукер studio лукер studio инструмент гугла для дашборда google дата studio какой-нибудь power bi юзал окифаем я полез и хотел сделать дашборд для пользователя вы кирину понял что для цвета слишком ну да кликхаусом наверно не дорастем но вот сделать допустим ну потому что ну или не скоро дорастем потому что кликаус если я правильно понимаю это больше для работы с большими данными а у нас маленькие данные да да да да да кликаус вот я интересовался так поверхностно он и он даже со всякими колоночными базами данных привык работать которые на скорость извлечения ориентируем да вот а мне нужно настроить интерфейс для пользователя то есть сейчас как выглядит интерфейс это просто блять три таблицы и 4 таблицы с отчетами а больше это и не нужно можно будет в них добавить какие-нибудь еще визуализовки но вот я пытался я думал это довольно банальная штука поэтому я полчаса наверное ковырялся в этом лукере чем хорош лукер тем что он бесплатный и это гугловский инструмент базовым ну ладно это но он допустим умеет подтягивать из google шутов я думаю из пост гривен тоже подтянет потому что поздряет и все-таки база давай сейчас посмотрим просто это с сейчас create data source Вот.",
    "speaker" : "Vasily"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "16:49-16:50",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "17:06-17:07"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Speaker 2",
    "timestamp" : "17:37-17:43"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "17:50-17:51"
  },
  {
    "timestamp" : "18:11-19:32",
    "text" : "Ну тут зависит от того, насколько ты высокоуровневая всю историю рассматриваешь. Ну, не знаю пока. Наверное, нет. Вернее, мне сейчас добавить просто к этому нечего, потому что я все равно сейчас фрагмент пока вижу этой истории. У тебя немножечко более более высокоуровневое восприятие Thank you.",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "Вот, кстати, крон.",
    "speaker" : "Speaker 3",
    "timestamp" : "19:49-19:50"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "Оно внутри, внутри, внутри.",
    "timestamp" : "20:25-20:26"
  },
  {
    "timestamp" : "20:27-20:30",
    "text" : "Я поэтому говорю, что насколько, как бы, с какого уровня на это смотрю.",
    "speaker" : "Speaker 6"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "20:40-20:40",
    "text" : "Данных?"
  },
  {
    "text" : "не понял как бы витрина данных но кто",
    "speaker" : "Speaker 7",
    "timestamp" : "20:54-21:06"
  },
  {
    "timestamp" : "21:12-21:27",
    "text" : "нет вообще вообще первый раз слышу про него вот я ну пар я его видел не пользовался Угу.",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Причем даже мы можем, это правда трудно управляется, ну в плане трудно отслеживать, потому что делается, допустим, на внутренних процедурах, вот, подгряжных, но она в этом плане очень мощна, и на ней можно прям хорошую такую аналитическую историю делать, ну до какого-то момента.",
    "timestamp" : "21:51-22:09"
  },
  {
    "text" : "Потом, конечно, лучше приходить на какой-нибудь кликхаус или еще что-то, которое именно со стат данными умеет работать, если мы все-таки дойдем до этого состояния.",
    "timestamp" : "22:09-22:16",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "22:30-22:34",
    "text" : "да это с большими данными это когда миллион миллионы миллиарды строк",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 6",
    "timestamp" : "22:39-22:59",
    "text" : "пас гринам дофига будет ну хаос это именно хранение не не реляция"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "23:16-23:50",
    "text" : "но все с чего-то Ну слушай, но как у гугловских инструментов, там есть нюансы интеграционные, как будто бы."
  },
  {
    "speaker" : "Speaker 1",
    "text" : "Ну, может быть, может быть, может быть.",
    "timestamp" : "23:59-24:01"
  },
  {
    "text" : "Я не подозрю, что коннекторы какие-то свои нужны для этой истории, либо ЦЗИ.",
    "speaker" : "Speaker 1",
    "timestamp" : "24:03-24:07"
  },
  {
    "text" : "я просто сга много работал угол налить и есть до коннектор подверг я могут",
    "speaker" : "Speaker 7",
    "timestamp" : "24:25-24:31"
  },
  {
    "speaker" : "Vasily",
    "text" : "О, нихуя себе.",
    "timestamp" : "24:33-24:35"
  },
  {
    "timestamp" : "24:38-24:39",
    "speaker" : "Vasily",
    "text" : "Прикол."
  },
  {
    "timestamp" : "24:40-24:41",
    "speaker" : "Vasily",
    "text" : "Ну вот."
  },
  {
    "text" : "Соответственно, в постгрю он умеет смотреть.",
    "timestamp" : "24:42-24:45",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "24:45-24:46",
    "speaker" : "Speaker 4",
    "text" : "Он умеет."
  },
  {
    "timestamp" : "24:46-24:46",
    "speaker" : "Speaker 4",
    "text" : "Все, класс."
  },
  {
    "text" : "Хорошо, что мы выбрали ее именно.",
    "speaker" : "Speaker 4",
    "timestamp" : "24:48-24:50"
  },
  {
    "timestamp" : "24:50-24:51",
    "speaker" : "Vasily",
    "text" : "Да."
  },
  {
    "speaker" : "Vasily",
    "text" : "Ну, это, я думаю, из говна и веток можно слепить и в Google Шитах.",
    "timestamp" : "24:53-24:59"
  },
  {
    "timestamp" : "25:00-25:02",
    "speaker" : "Vasily",
    "text" : "В принципе, там работает."
  },
  {
    "speaker" : "Vasily",
    "text" : "Я разобрался, кстати, почему у меня копировались строки.",
    "timestamp" : "25:02-25:04"
  },
  {
    "timestamp" : "25:06-25:09",
    "speaker" : "Vasily",
    "text" : "Так что, ну, нормально, короче, я разберусь."
  },
  {
    "timestamp" : "25:10-25:10",
    "speaker" : "Vasily",
    "text" : "Сделаю это."
  },
  {
    "speaker" : "Speaker 8",
    "text" : "y Good day.",
    "timestamp" : "25:13-25:13"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "25:14-25:15",
    "text" : "Дальше, дальше."
  },
  {
    "timestamp" : "25:18-25:19",
    "speaker" : "Vasily",
    "text" : "Приемка сообщений."
  },
  {
    "text" : "Смотри, по приемке сообщений.",
    "timestamp" : "25:19-25:21",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "25:21-25:23",
    "text" : "А, давай знаешь как еще.",
    "speaker" : "Vasily"
  },
  {
    "text" : "Ну ладно, это вряд ли мы отделим.",
    "timestamp" : "25:23-25:25",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "25:29-25:38",
    "text" : "То есть нужен непосредственно бот, который будет взаимодействовать с заказчиком."
  },
  {
    "timestamp" : "25:44-25:45",
    "text" : "Нужна приемку сообщений.",
    "speaker" : "Vasily"
  },
  {
    "text" : "Это расшифровка.",
    "speaker" : "Vasily",
    "timestamp" : "25:46-25:47"
  },
  {
    "text" : "И вот здесь я поковырял assembly.ai.",
    "speaker" : "Vasily",
    "timestamp" : "25:48-25:50"
  },
  {
    "text" : "в assembly и я и нужно сделать она она во первых умеет большие сообщения расшифровывать во вторых она их умеет на лету обрабатывать и не знаю будет это лучше или я не очень разобрался как именно на это делает но она умеет допустим сразу по темам группировать я тебе покажу пример вот proof of concept как я отрабатывал технологию смотри вот мой prompt я говорю типа вот транскрипция обработай ее превратив отчет отчет формируется по той логике которая вчера придумал есть таблица с отчетами и таблица по каждой сущности отчет на дату это одна строка в этой таблице привязаны к этой сущности А, слушай, Серег, знаешь что, я понял, я сейчас, у меня есть какие-то идеи и какое-то видение, которое у меня сформировано и мне кажется понятным.",
    "timestamp" : "25:52-27:30",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "26:01-26:02"
  },
  {
    "timestamp" : "26:13-26:16",
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Угу.",
    "timestamp" : "26:59-27:00"
  },
  {
    "timestamp" : "27:01-27:05",
    "speaker" : "Speaker 3",
    "text" : "У меня знаешь, что, кстати, блин, это мысль была под бьесы."
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Угу.",
    "timestamp" : "27:10-27:10"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "27:32-27:33",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Vasily",
    "text" : "Скорее всего, это мое видение.",
    "timestamp" : "27:35-27:37"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Mm-hmm.",
    "timestamp" : "27:38-27:40"
  },
  {
    "text" : "Давай, может быть, ты позадаешь вопросы.",
    "timestamp" : "27:38-27:40",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Давай попробуем.",
    "timestamp" : "27:42-27:43"
  },
  {
    "speaker" : "Vasily",
    "text" : "Ну вот, смотри.",
    "timestamp" : "27:54-27:55"
  },
  {
    "text" : "Смотри, у меня...",
    "speaker" : "Vasily",
    "timestamp" : "27:56-27:58"
  },
  {
    "text" : "Первое, что я хочу сделать.",
    "speaker" : "Vasily",
    "timestamp" : "28:00-28:02"
  },
  {
    "speaker" : "Vasily",
    "text" : "Я хочу за сегодня-завтра в идеале доделать воркер.",
    "timestamp" : "28:02-28:10"
  },
  {
    "text" : "Ok.",
    "speaker" : "Speaker 3",
    "timestamp" : "28:14-28:16"
  },
  {
    "text" : "Одним из важных кусков воркера является отправка сообщений.",
    "speaker" : "Vasily",
    "timestamp" : "28:18-28:23"
  },
  {
    "text" : "Приемка сообщений уже худо-бедно работает.",
    "speaker" : "Vasily",
    "timestamp" : "28:26-28:28"
  },
  {
    "text" : "Ее бы хорошо превратить в этот Ну чтобы она могла 20-минутное сообщение расшифровать Но моя задача это допилить воркер Соответственно, ну я завтра пойду Ну я наверное буду завтра его пилить основное Потому что там нужно прям конкретно поскрепить мозгами.",
    "speaker" : "Vasily",
    "timestamp" : "28:29-29:03"
  },
  {
    "timestamp" : "28:40-28:43",
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Speaker 2",
    "timestamp" : "28:55-28:55",
    "text" : "Mm-hmm."
  },
  {
    "timestamp" : "29:04-29:08",
    "text" : "Если я этого не сделаю сейчас, то дальше мне будет очень сложно.",
    "speaker" : "Vasily"
  },
  {
    "text" : "Нет, без проблем. Я больше про то, что сейчас процесс...",
    "timestamp" : "29:10-29:13",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "В моменте, сейчас мы с этой штукой...",
    "timestamp" : "29:13-29:15"
  },
  {
    "text" : "Я тебе вопросы позадаю в том объеме, в котором я пойму.",
    "timestamp" : "29:16-29:19",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Мы сегодня еще что-то планируем на двоих?",
    "timestamp" : "29:19-29:21"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "29:22-29:23",
    "text" : "Или мы на это финале сегодня и все?"
  },
  {
    "text" : "просто ради процесса понятия.",
    "timestamp" : "29:24-29:26",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "29:25-29:28",
    "text" : "Да нет, ну давай поймем.",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Или у нас еще что-то есть?",
    "timestamp" : "29:26-29:27"
  },
  {
    "speaker" : "Vasily",
    "text" : "Ну, я на самом деле хотел бы завтра больше этим заняться.",
    "timestamp" : "29:28-29:35"
  },
  {
    "timestamp" : "29:36-29:40",
    "speaker" : "Vasily",
    "text" : "И я бы хотел, чтобы мы с тобой прям сели и попилили."
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Угу.",
    "timestamp" : "29:36-29:36"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Угу.",
    "timestamp" : "29:40-29:40"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "29:40-29:42",
    "text" : "Потому что ты мне про Redis, например, подсказал."
  },
  {
    "text" : "Это было суперценно.",
    "timestamp" : "29:42-29:43",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "29:45-29:46",
    "speaker" : "Speaker 2",
    "text" : "Угу, угу, угу."
  },
  {
    "timestamp" : "29:45-29:50",
    "speaker" : "Vasily",
    "text" : "Потому что я бы сейчас упахался бы, сделал бы там этот злоебучий workflow."
  },
  {
    "speaker" : "Vasily",
    "text" : "И выяснил бы, что я наделал какого-то говна, которое придется переделать.",
    "timestamp" : "29:51-29:55"
  },
  {
    "timestamp" : "29:56-30:30",
    "text" : "полезно совместная эта история посмотри давай так вот я сейчас могу ну давай попробуем просто меня максимум на минут 20 есть потом не надо будет побегать потом еще доработать вот мы можем завтра просто завтра короче можем спланировать в целом тоже созвониться там я готов сколько-то времени выделить там тоже наверно час ну максимум полтора потолок потому что у меня завтра тоже очень рабочий день.",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "сегодня сегодня мы бы синхронизировались как ты поняли вообще вообще к ним ты был лучше погрузился в контекст хорошо хорошо нормально давай хорошо файл хорошо файл ну давай тогда задавай вопросики чтобы нам синхронизируются вот смотри я у меня какое видение вот я поделился бизнесовой частью вот у нас есть вот это такая детализация бизнесовой части то есть тот функционал который нам нужно разработать вот как будет проходить этот бизнес процесс сбора отчетности совещание усел подготовка к совещанию промежуточный пинг и вот это вот функциональные блоки красным выделены приоритетны серым это просто копия что этот блок на этих стадиях тоже действует все то есть сбор отчета внесения новых отчетов базу данных парсинг протокола тоже скоро потребуется вот этот тот функционал который нам нужно реализовать с точки зрения такой сценарный точнее те сценарии которые нужно системе реализовать я прям проанализирую дальше для того чтобы это реализовать нам нужно функция нам нужно архитектурные компоненты вот эти вот доделать вот этот худо-бедно работает в принципе с пивом потянет как очень можно ну там нас assembly и переключить я думаю будет очень быстро то минут 40 дальше ну варкер это самое злоебучее и отправка сообщений тоже вот здесь нужно будет это сделать соответственно здесь самая большая сложность и и и пиль я и я не очень понимаю как там и разделить вопрос можно ли ее операционно декомпозирует то есть если это в одном workflow то мы не можем над ними работать одновременно к сожалению хорошая мысль んー Ну да, makes sense.",
    "speaker" : "Vasily",
    "timestamp" : "30:00-33:50"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "30:39-30:39",
    "text" : "Так."
  },
  {
    "text" : "Но ты вопросики хочешь просто из открытого контекста.",
    "timestamp" : "30:41-30:43",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Ничего мне накидывать не будет сверху, да?",
    "timestamp" : "30:43-30:45"
  },
  {
    "timestamp" : "30:56-30:59",
    "speaker" : "Speaker 4",
    "text" : "Но бизнесовая мне понятно, более-менее."
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "31:27-31:28",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "31:42-31:45"
  },
  {
    "text" : "Mm hmm.",
    "timestamp" : "31:46-31:46",
    "speaker" : "Speaker 2"
  },
  {
    "timestamp" : "31:58-31:59",
    "speaker" : "Speaker 2",
    "text" : "Mm hmm."
  },
  {
    "text" : "Mm hmm.",
    "speaker" : "Speaker 2",
    "timestamp" : "32:05-32:06"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm hmm.",
    "timestamp" : "32:15-32:17"
  },
  {
    "timestamp" : "32:28-32:29",
    "speaker" : "Speaker 2",
    "text" : "Mm hmm."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Слушай, надо посмотреть, в каких части она состоит, потому что я думаю, что разделить можно, а вот, ну, как бы любую задачу можно еще декомпозировать.",
    "timestamp" : "32:44-32:53"
  },
  {
    "timestamp" : "33:04-33:05",
    "text" : "мы знаешь, как можем сделать?",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "мы можем сделать копию воркфлоу делать просто для этапа разработки потому что из воркфлоу воркфлоу мы можем копировать ноды, это без проблем и да я работаю с копией всегда, и мы это устанавливаем в качестве подхода.",
    "timestamp" : "33:05-33:24"
  },
  {
    "timestamp" : "33:25-33:31",
    "speaker" : "Speaker 3",
    "text" : "Вот я работаю в фотоскопе и делаю какую-то там часть, допустим. Потом, когда она сделана, мы ее вставляем."
  },
  {
    "timestamp" : "33:31-33:48",
    "text" : "Мы можем по ходу пьесы мокать данные. То есть, допустим, если у нас воркер еще неполноценный, но мы знаем, что у нас на определенном этапе, который я делаю, мы на входе получаем примерно вот это, имеем вот это, и на выходе должны получить примерно вот это. И посередине как это делается, непонятно пока.",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "или там как бы нужно либо респерчить, либо делать и так далее.",
    "timestamp" : "33:49-33:52",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "И мы, получается, мы с тобой пили МОК на вход, как бы набор JSON данных, которые мы на входе имеем.",
    "timestamp" : "33:52-33:58"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "И прямо у N8M есть возможность его лочить, то есть прям подавать на вход, да, вот эту историю.",
    "timestamp" : "33:59-34:06"
  },
  {
    "text" : "Да, да, да, да, я пользуюсь ей.",
    "timestamp" : "34:03-34:04",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "И на выход та же самая пьеса.",
    "timestamp" : "34:07-34:08"
  },
  {
    "text" : "И мы, получается, мы имеем на входе вот это, на выходе вот это.",
    "timestamp" : "34:08-34:11",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Наша задача, ну как бы, и я могу это, имея на входе вот это, и на выходе вот это, я могу, соответственно, какой-то там workflow внутри построить.",
    "timestamp" : "34:11-34:18"
  },
  {
    "text" : "Да, make sense, make sense.",
    "speaker" : "Vasily",
    "timestamp" : "34:17-34:18"
  },
  {
    "text" : "А потом, когда я его сделаю, мы с тобой его просто копируем в основной и его адаптируем.",
    "speaker" : "Speaker 3",
    "timestamp" : "34:18-34:23"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Но это в любом случае экономит ресурс твой и не связывает руки мне.",
    "timestamp" : "34:23-34:28"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "34:34-34:35",
    "text" : "В общем, я думаю, что так."
  },
  {
    "speaker" : "Vasily",
    "text" : "Да, да, make sense, это хорошая мысль.",
    "timestamp" : "34:34-34:36"
  },
  {
    "speaker" : "Vasily",
    "text" : "Исполнение промпта.",
    "timestamp" : "34:41-34:42"
  },
  {
    "timestamp" : "34:44-34:47",
    "speaker" : "Speaker 3",
    "text" : "Это мы можем вполне даже цельный workflow делить."
  },
  {
    "speaker" : "Vasily",
    "text" : "да, makes sense makes sense мгм Ну, согласен, да но единственное два компонента, которые можно выделить в subworkflow, это вот эти потенциально давай вот по тому, что я написал сейчас компоненты воркера насколько понятно давай это прям есть уже готовый пример запуск цикла смотри происходит происходит событие в в базе любое новая задача или апдейт по задаче чат gpt создал какой-то там канал под названием tasks wake up да вот да вот грязь сама присылает вот дает по задаче ну вот нет тут в 8 н есть такой вариант ли сен for и вот тут есть канал ну вот до long story short короче есть канал и мне показалось что это нормально все события отправить в один канал это правильно архитектурно ну мне показалось это логично ну это служебное объединение на период теста потому что здесь одна форма приходит здесь другая короче по каналу приходит task id.",
    "timestamp" : "34:48-37:42"
  },
  {
    "timestamp" : "34:48-34:49",
    "speaker" : "Speaker 3",
    "text" : "То есть ничего такого в этом нет."
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "34:50-34:52",
    "text" : "Особенно, если он достаточно сложный."
  },
  {
    "timestamp" : "34:52-34:58",
    "speaker" : "Speaker 3",
    "text" : "Но опять же, вот я сейчас, работая с базами, я понимаю, что чисто..."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "У меня хорошее пространственное воображение, но все равно мне удобней, эффективней получается работать, когда сапфлоу есть, когда задачки разбиты на подзадачки.",
    "timestamp" : "35:00-35:10"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "35:10-35:11",
    "text" : "Тогда их легче."
  },
  {
    "timestamp" : "35:11-35:13",
    "speaker" : "Speaker 3",
    "text" : "Если это один большой, там проще запутаться."
  },
  {
    "timestamp" : "35:14-35:22",
    "text" : "Вроде как бы удобно, что в одном месте, но неудобно, что очень много данных, и можно что-нибудь случайно посерить, и не понять даже где.",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Потом опять отладка, это длинная пьеса.",
    "timestamp" : "35:22-35:24"
  },
  {
    "text" : "В N8N время много на это уходит.",
    "timestamp" : "35:24-35:26",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Может быть, имеет смысл вот этот воркер, на сапфлоркеры все-таки, на сапфлор, вернее, какие-то раскидать.",
    "timestamp" : "35:28-35:34"
  },
  {
    "timestamp" : "35:34-35:36",
    "text" : "Но это пока идея на уровне попробовать.",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Может быть, что-то выделить в качестве сапфлора, потом понять, что, допустим, это классно, или понять, что нет, не классно, давайте засовывать обратно все.",
    "timestamp" : "35:38-35:45"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "да вот это хорошо уже хорошо посмотри я первый непонятно совсем как бы мне надо мне надо на примере описать я видишь как бы у нас до основной мы немножечко контекста раскидываемся так события в данном случае за что запись строки как ловим канал по сгри",
    "timestamp" : "35:54-36:53"
  },
  {
    "text" : "Я с этой штукой не знаком.",
    "speaker" : "Speaker 5",
    "timestamp" : "37:01-37:03"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Это да, я работаю с PassGray на синхронизации и смотрел, что она в целом умеет, но я с каналогом вообще не",
    "timestamp" : "37:10-37:21"
  },
  {
    "text" : "знакомы может быть",
    "speaker" : "Speaker 9",
    "timestamp" : "37:27-37:31"
  },
  {
    "text" : "Дальше.",
    "speaker" : "Vasily",
    "timestamp" : "37:45-37:46"
  },
  {
    "speaker" : "Speaker 10",
    "timestamp" : "37:45-37:48",
    "text" : "здесь выделяешь поле выбираешь полина"
  },
  {
    "speaker" : "Vasily",
    "text" : "Да, я просто делаю вот это поле, и что бы у меня до этого не происходило, какой бы триггер.",
    "timestamp" : "37:47-37:55"
  },
  {
    "text" : "Вот здесь я вручную триггерю.",
    "speaker" : "Vasily",
    "timestamp" : "37:55-37:56"
  },
  {
    "text" : "Главное, что стартует все с task id.",
    "timestamp" : "37:57-37:59",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "37:59-38:01",
    "text" : "Вот в этом моя задача."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "38:01-38:02",
    "text" : "ID-шник, изменившийся задача."
  },
  {
    "timestamp" : "38:04-38:12",
    "speaker" : "Vasily",
    "text" : "Дальше я попросил чат gpt написать один скрипт, который что делает?"
  },
  {
    "text" : "Он лочит задачу, переводит ее в in progress.",
    "timestamp" : "38:13-38:16",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 2",
    "timestamp" : "38:16-38:16",
    "text" : "Mm-hmm."
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Speaker 2",
    "timestamp" : "38:18-38:19"
  },
  {
    "timestamp" : "38:18-38:22",
    "speaker" : "Vasily",
    "text" : "Первым делом, чтобы параллельные исполнения никакие не запустились."
  },
  {
    "speaker" : "Vasily",
    "text" : "А во-вторых, он анализирует.",
    "timestamp" : "38:23-38:27"
  },
  {
    "speaker" : "Vasily",
    "text" : "Если задача в статусе новый, то он возвращает, что это new task.",
    "timestamp" : "38:28-38:32"
  },
  {
    "speaker" : "Vasily",
    "text" : "Если это update по задаче, то он возвращает, это апдейт и возвращает payload то есть он возвращает payload с информации это новая задача или апдейт по задаче там будет разный пилот у меня на это дальше выявление настроены если это новая задача то он идет по ветке формирования контекста в редисе вот он берет джессон пайлот который лежит в пайлоте и формирует из него редис контекст все мы загрузились блять в чем чат gpt сказал в том ель да В чем мне чат GPT сказал, в том я и храню.",
    "timestamp" : "38:34-39:29"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "38:34-38:35"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Speaker 2",
    "timestamp" : "38:38-38:39"
  },
  {
    "timestamp" : "38:50-38:50",
    "speaker" : "Speaker 2",
    "text" : "Mm hmm."
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm hmm.",
    "timestamp" : "38:54-38:54"
  },
  {
    "text" : "Mm hmm.",
    "speaker" : "Speaker 2",
    "timestamp" : "39:04-39:05"
  },
  {
    "timestamp" : "39:16-39:28",
    "speaker" : "Speaker 3",
    "text" : "чем хранить тем вроде сохранить в набор в набу в наборах Ну может быть."
  },
  {
    "speaker" : "Vasily",
    "text" : "Там вроде как есть хэши, это отдельные кусочки.",
    "timestamp" : "39:30-39:33"
  },
  {
    "timestamp" : "39:33-39:35",
    "text" : "Хочу другую.",
    "speaker" : "Speaker 5"
  },
  {
    "text" : "Nie wiem.",
    "speaker" : "Speaker 5",
    "timestamp" : "39:35-39:35"
  },
  {
    "text" : "Да, я...",
    "timestamp" : "39:36-39:37",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Vasily",
    "text" : "Возможно, в хэшах потребуется какую-то часть контекста хранить.",
    "timestamp" : "39:40-39:43"
  },
  {
    "timestamp" : "39:44-39:46",
    "speaker" : "Vasily",
    "text" : "Я, кстати, подготовил еще описание, знаешь, чего?"
  },
  {
    "speaker" : "Vasily",
    "text" : "Контекстов по задаче.",
    "timestamp" : "39:47-39:48"
  },
  {
    "speaker" : "Vasily",
    "text" : "Я тебе сейчас добавлю тоже.",
    "timestamp" : "39:49-39:51"
  },
  {
    "speaker" : "Vasily",
    "text" : "вот это та информация которая нужна для задачи вот worker работает задачей с таской с какой информацией он работает, какая информация нужна для того, чтобы исполнить процесс.",
    "timestamp" : "39:57-40:24"
  },
  {
    "speaker" : "Speaker 11",
    "text" : "это для человеков или для системы Mm-hmm.",
    "timestamp" : "40:25-40:34"
  },
  {
    "timestamp" : "40:28-40:31",
    "speaker" : "Vasily",
    "text" : "Это описание для человеков и для чатов GPT."
  },
  {
    "timestamp" : "40:34-40:48",
    "text" : "То есть ему нужна информация, ну вот допустим, контекст, какой текущий шаг, весь бизнес-процесс, текущие инструкции для агента, статус задачи, выход шага, выход задачи, история исполнения.",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "40:49-40:58",
    "speaker" : "Vasily",
    "text" : "Плюс еще там масса полей, например, от какого пользователя в каком канале пришло сообщение, соответственно, куда ответ сладит."
  },
  {
    "timestamp" : "41:01-41:07",
    "speaker" : "Vasily",
    "text" : "Технические, типа там, дата, когда залочены и так далее."
  },
  {
    "speaker" : "Vasily",
    "text" : "Вот.",
    "timestamp" : "41:12-41:13"
  },
  {
    "speaker" : "Vasily",
    "text" : "но это смысловое я вот как раз где хранится в течение цикла видишь тут анализировал вот в редисе, в подгрессе как раз для того чтобы разобраться есть поля вот эти поля заведены уже в таблицу tasks в пастгере это будет ой блять это будет этот это будет в описании док датабейс который я создал вчера тебе писал с документации всех таблиц вот я это туда тоже опишу да это задача агента нет это агентская задача вот агентская задача сейчас вот вот вот таблица tasks видишь здесь уже вся вот эта вот ебала уже имеется чат gpt создает сам да все у индексы индексов окей файл короче вот док каталог к слову сказать вот в этом док каталоге должны быть описаны все столбцы таблицы индексы constraint и вот ever короче вот чем мы создаем просто любой SQL запрос по созданию чего-то в базе. В нем должна быть часть сделать запись в док-каталог.",
    "timestamp" : "41:15-44:36"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "41:28-41:39",
    "text" : "и Это модель, которая будет в коде."
  },
  {
    "timestamp" : "41:48-41:48",
    "speaker" : "Speaker 5",
    "text" : "Так."
  },
  {
    "timestamp" : "42:09-42:14",
    "speaker" : "Speaker 3",
    "text" : "Ты мне, кстати, покажешь, как ты это делаешь, чтобы я не придумал ничего своего."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Так, смотри, подожди, давай еще раз вот с этой историей.",
    "timestamp" : "42:14-42:18"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "42:19-42:26",
    "text" : "Это задача для там воркера условного, или у меня, короче, немножечко дает агента."
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "42:26-42:31",
    "text" : "То есть у нас это не пересекается с теми задачами, которые сейчас я синхроню."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Это разные сущности.",
    "timestamp" : "42:31-42:32"
  },
  {
    "timestamp" : "42:35-42:36",
    "speaker" : "Speaker 3",
    "text" : "Да, окей."
  },
  {
    "text" : "Я тебе, кстати, рекомендую этот Armour Assistant, у тебя появился он.",
    "speaker" : "Speaker 9",
    "timestamp" : "42:59-43:02"
  },
  {
    "text" : "ты индексы создаешь?",
    "speaker" : "Speaker 3",
    "timestamp" : "43:16-43:17"
  },
  {
    "timestamp" : "43:21-43:34",
    "speaker" : "Speaker 3",
    "text" : "а что создает? покажи разверни индексы Индексы очень сильно влияют на производительность."
  },
  {
    "text" : "Их потом надо будет к ним очень внимательно отнестись.",
    "speaker" : "Speaker 3",
    "timestamp" : "43:35-43:37"
  },
  {
    "timestamp" : "43:40-43:41",
    "text" : "И иногда их надо...",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "В данном случае у тебя не одиночные индексы, а иногда надо создавать группированные, когда запросы по группам идут.",
    "timestamp" : "43:41-43:46"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Не индексы индексы, а индексы полей, группы полей.",
    "timestamp" : "43:47-43:51"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Один индекс делается, допустим, на группу полей.",
    "timestamp" : "43:52-43:54"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Если идет запрос на группу полей сразу, допустим, а выборка какая-то в SQL, и в ней выбирается не одно поле, а сразу там, допустим, три.",
    "timestamp" : "43:54-44:02"
  },
  {
    "timestamp" : "44:03-44:07",
    "text" : "в условии VR, то индексом создавать на эти стрижки.",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Ну, это так, пока, для контекста.",
    "timestamp" : "44:07-44:08"
  },
  {
    "speaker" : "Speaker 2",
    "timestamp" : "44:25-44:26",
    "text" : "Угу."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "тут я получать только для бази щас",
    "timestamp" : "44:42-44:43"
  },
  {
    "text" : "Да, это только для базы, но он просто...",
    "timestamp" : "44:44-44:46",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "44:47-44:48",
    "speaker" : "Vasily",
    "text" : "Почему это удобно?"
  },
  {
    "text" : "Потому что он...",
    "speaker" : "Vasily",
    "timestamp" : "44:48-44:49"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "44:51-44:58",
    "text" : "Я говорю просто, вот в этом SQL запросе, каждый SQL запрос обновляет док-каталог. Просто, блядь, и не ебет."
  },
  {
    "text" : "А ты какой-то процесс-то делаешь?",
    "timestamp" : "45:00-45:01",
    "speaker" : "Speaker 9"
  },
  {
    "speaker" : "Vasily",
    "text" : "да нет в чате gpt я сделал как я создал вот так вот проект вот в project файл добавил таблицу док-каталог csw и в инструкциях написал вот такой каждый раз когда ты создаешь что-то в базе данных с кивили обновляю вот эту таблицу я просто к выявил эту прогоняю в к вырету ли и все то есть вот я допустим хочу создать не не нет никакой cssv я один раз загрузил вот она док каталог это описание таблицы она в файлах проекта дальше я работаю и понимаю что нужно создать у меня есть таблица task я понимаю что нужно создать таблицу хуя скс я говорю создай мне таблицу хуя скс пожалуйста с такими-то столбцами там что-то размышляю с чатом gpt продумываю бизнес логику потом говорю окей ибо не мне SQL query, чтобы создать таблицу Whoiasks. Он создает таблицу Whoiasks и в этой же query он дополнительно пишет обновить док-каталог и написать таблицу Whoiasks для того-то ну да не-не-не-не-не здесь здесь нет ничего вот этот это описание того как выглядит таблица док-каталог да это просто структура таблицы с то есть это выдержка из таблицы док-каталог в которой описана сама таблица док-каталог то есть док-каталог является частью база значит она должна быть описана сама в себе все вот соответственно вот зачем лишь таблицы для хранение документации по схеме чего да что именно непонятно хорошо мне сейчас признался не очень понятно чего не понятно давай покопаем немножко вот я помню Смотри, вот возможно тебе не хватает вот этого.",
    "timestamp" : "45:02-49:41"
  },
  {
    "timestamp" : "45:13-45:14",
    "text" : "Угу.",
    "speaker" : "Speaker 2"
  },
  {
    "text" : "Угу.",
    "timestamp" : "45:21-45:21",
    "speaker" : "Speaker 2"
  },
  {
    "text" : "Угу.",
    "speaker" : "Speaker 2",
    "timestamp" : "45:25-45:26"
  },
  {
    "speaker" : "Speaker 12",
    "timestamp" : "45:42-45:45",
    "text" : "И ты её потом загружаешь сюда через импорт."
  },
  {
    "speaker" : "Speaker 13",
    "text" : "Ну в смысле нет, ты CSW загружаешь?",
    "timestamp" : "45:53-45:56"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "46:42-46:42",
    "text" : "Не, я понял."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "у тебя до каталог то в учае учиться в базе видите свои файлы базу обновляешь а просто с келом дополнительно у тебя два источник два источника данных получается есть project files которые дополнение идет и одновременно",
    "timestamp" : "46:42-46:58"
  },
  {
    "speaker" : "Speaker 12",
    "text" : "а просто для структуры",
    "timestamp" : "47:09-47:12"
  },
  {
    "text" : "я понял",
    "speaker" : "Speaker 2",
    "timestamp" : "47:18-47:19"
  },
  {
    "timestamp" : "47:24-48:03",
    "text" : "я понял тебя я понял это повысили нам знаешь что надо и чего сейчас нет и отчего наверное мне и немножко трудно пока что въезжать сегментарные задачки, фрагменты я хорошо понимаю, типа синхронизация, это у меня в моей области, в моем скоупе находится.",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "48:04-48:06",
    "text" : "А вот вообще глобально, мне не понятно до сих пор.",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "48:06-48:10",
    "text" : "Я очень общими словами могу это объяснить."
  },
  {
    "timestamp" : "48:11-48:21",
    "text" : "Не хватает описания, вообще всю историю, не хватает описания бизнес-логики внутренней, такой, ну, для...",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "48:23-48:45",
    "text" : "Больше не бизнесовыми терминами, а условно говоря, у нас есть разный workflow, как они между собой связаны, какие задачи они решают каждой в отдельности, и почему каждый нода таким образом сделан, и больше того, что там внутри."
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "48:50-48:52",
    "text" : "Вот это очень высокоуровнево, что ты понимал."
  },
  {
    "timestamp" : "48:54-49:28",
    "text" : "то есть это это не документация по проекту частью но не вся непонятно потому что для меня немножко сейчас бизнес-процесса разрознен то есть тут показываешь его и я смотрел даже как будто что в мира я в общем его понимаю как бы но для тебя например для человека, который с этим ежедневно сталкивается и настраивает эти истории, ну, там много очень понятного и много понятного по умолчанию.",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "Чего непонятного, допустим, мне, и я могу понять только это, ну, пройдя этот этап, как бы, условно говоря, то есть шагово понять, что происходит.",
    "timestamp" : "49:28-49:37",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "49:37-49:38",
    "text" : "Mm-hmm."
  },
  {
    "text" : "Вот так будет выглядеть инструкция, которую хавает воркер и исполняет.",
    "timestamp" : "49:46-49:51",
    "speaker" : "Vasily"
  },
  {
    "text" : "Вот есть операция, операция, которую должен выполнить воркер.",
    "timestamp" : "49:58-50:02",
    "speaker" : "Vasily"
  },
  {
    "text" : "То есть Да Вот Вот сбор отчета, например То есть есть разные элементы просто таблица задачи по которым требуется отчет да это сейчас благодаря тому что ты пилишь но не только задачи там есть разные объекты задачи открытые вопросы да вот здесь благодаря тому что ты пилишь это будет из кивили ковыря которая формирует одну или больше таблиц зависимости от того как мы пойдем дальше она же наверное формирует список пользователей которым нужно разослать.",
    "timestamp" : "50:07-51:15",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "50:07-50:20",
    "text" : "Подожди, давай по другому зайдем. Это как фрагмент, мне понятно, откуда ноги у него растут, как эта последовательность будет выглядеть."
  },
  {
    "timestamp" : "50:20-50:50",
    "text" : "то есть это менеджер не знает что загружает это говорит в чат вот какой то вот что это ну вот смотри хорошо у нас в данном случае реестр это что реестр объект это задачи",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "50:51-50:53",
    "speaker" : "Speaker 10",
    "text" : "Да, там есть открытый вопрос, результаты."
  },
  {
    "text" : "Дальше она формирует запрос.",
    "timestamp" : "51:17-51:19",
    "speaker" : "Vasily"
  },
  {
    "text" : "У тебя это все в одном запросе может даже быть больше того, я тебе скажу.",
    "timestamp" : "51:18-51:22",
    "speaker" : "Speaker 10"
  },
  {
    "timestamp" : "51:22-51:23",
    "speaker" : "Vasily",
    "text" : "Окей, файн."
  },
  {
    "text" : "В одной витрине данных.",
    "timestamp" : "51:22-51:24",
    "speaker" : "Speaker 10"
  },
  {
    "speaker" : "Vasily",
    "text" : "Да, файн, без проблем.",
    "timestamp" : "51:25-51:27"
  },
  {
    "text" : "Дальше он отправляет запрос отчета.",
    "speaker" : "Vasily",
    "timestamp" : "51:28-51:31"
  },
  {
    "speaker" : "Vasily",
    "text" : "Отчет запроса, запрос отчета выглядит следующим образом.",
    "timestamp" : "51:31-51:34"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "51:36-51:39",
    "text" : "Сообщение в бот пользователю Вася Пупкин."
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Угу.",
    "timestamp" : "51:40-51:41"
  },
  {
    "speaker" : "Vasily",
    "text" : "Васек, пришло время отчитываться по задачам.",
    "timestamp" : "51:40-51:44"
  },
  {
    "timestamp" : "51:45-51:47",
    "text" : "Вот какие задачи у меня на тебя есть.",
    "speaker" : "Vasily"
  },
  {
    "text" : "Спасибо.",
    "speaker" : "Speaker 2",
    "timestamp" : "51:46-51:46"
  },
  {
    "timestamp" : "51:48-51:51",
    "speaker" : "Vasily",
    "text" : "Или даже я сейчас склоняюсь."
  },
  {
    "timestamp" : "51:51-51:54",
    "speaker" : "Vasily",
    "text" : "Чувак, отчитайся, пожалуйста, по задачам."
  },
  {
    "timestamp" : "51:54-51:56",
    "speaker" : "Vasily",
    "text" : "Ссылка вот Google Doc с твоими задачами."
  },
  {
    "text" : "Угу.",
    "timestamp" : "51:58-51:58",
    "speaker" : "Speaker 2"
  },
  {
    "text" : "Он проходит по ссылке, ну потому что там будет простыня.",
    "timestamp" : "51:59-52:01",
    "speaker" : "Vasily"
  },
  {
    "text" : "В Telegram сообщении не самый удобный интерфейс.",
    "speaker" : "Vasily",
    "timestamp" : "52:02-52:04"
  },
  {
    "text" : "Удобнее таблицу.",
    "speaker" : "Vasily",
    "timestamp" : "52:05-52:06"
  },
  {
    "text" : "Проходи по ссылке, там твои задачи.",
    "timestamp" : "52:06-52:10",
    "speaker" : "Vasily"
  },
  {
    "text" : "Он проходит на конкретный лист с конкретными задачами, по которым нужно отчитаться.",
    "speaker" : "Vasily",
    "timestamp" : "52:10-52:16"
  },
  {
    "timestamp" : "52:16-52:18",
    "speaker" : "Vasily",
    "text" : "И начитывает голосовуху."
  },
  {
    "text" : "Вот здесь пользователь начитывает голосовуху.",
    "timestamp" : "52:19-52:21",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Okay.",
    "timestamp" : "52:22-52:22"
  },
  {
    "text" : "Мои задачи то, сё, пятое, десятое приходят в нейросетку.",
    "timestamp" : "52:22-52:27",
    "speaker" : "Vasily"
  },
  {
    "text" : "Нейросетка распознает голосовуху и сравнивает.",
    "timestamp" : "52:30-52:36",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Vasily",
    "text" : "Вот текст, что мне пользователь напиздел.",
    "timestamp" : "52:36-52:40"
  },
  {
    "timestamp" : "52:41-52:44",
    "speaker" : "Vasily",
    "text" : "Вот реестр объектов, по которым он пиздел."
  },
  {
    "text" : "И формирует, вот как я тебе здесь показывал.",
    "timestamp" : "52:47-52:52",
    "speaker" : "Vasily"
  },
  {
    "text" : "Вот, у нее вот такой промпт есть.",
    "speaker" : "Vasily",
    "timestamp" : "52:57-52:59"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "53:00-53:01",
    "text" : "Вот транскрипция."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "53:02-53:04",
    "text" : "Выглядит примерно в таком виде."
  },
  {
    "speaker" : "Speaker 2",
    "timestamp" : "53:05-53:06",
    "text" : "Mm-hmm."
  },
  {
    "timestamp" : "53:06-53:36",
    "speaker" : "Vasily",
    "text" : "со спикерами таблица с результатами по которым менеджер отчитывался вот просто таблица таблица с поручениями таблица с темами это я прям методом control c control в из коды скопировал потом да это будет результаты с киевик Да, абсолютно."
  },
  {
    "text" : "Mm-hmm, mm-hmm, mm-hmm, mm-hmm.",
    "timestamp" : "53:08-53:10",
    "speaker" : "Speaker 2"
  },
  {
    "timestamp" : "53:22-53:55",
    "speaker" : "Speaker 3",
    "text" : "это то что мы сейчас в базе получим по синхронизации это понятно а потом из той базы которую мы сейчас синхронить коды вот вот не таблицу, а запись в таблице."
  },
  {
    "text" : "И, да.",
    "speaker" : "Vasily",
    "timestamp" : "53:37-53:39"
  },
  {
    "text" : "А дальше задача вот этого модуля создать таблицу с отчетами.",
    "speaker" : "Vasily",
    "timestamp" : "53:40-53:49"
  },
  {
    "speaker" : "Vasily",
    "text" : "Таблица с отчетами будет выглядеть вот так.",
    "timestamp" : "53:49-53:51"
  },
  {
    "timestamp" : "53:51-53:51",
    "speaker" : "Vasily",
    "text" : "Отчет."
  },
  {
    "timestamp" : "53:52-53:53",
    "speaker" : "Vasily",
    "text" : "Схема подготовлена."
  },
  {
    "timestamp" : "53:56-53:57",
    "text" : "Чего?",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "не таблицу отчетов, а запись таблицы. Да, но это я видел, это в коде видел и сейчас фактически слепок этого имеем по сгре",
    "timestamp" : "53:58-54:19"
  },
  {
    "speaker" : "Vasily",
    "text" : "Записи в таблице, да.",
    "timestamp" : "54:00-54:02"
  },
  {
    "text" : "он должен сформировать записи записи выглядят следующим образом отчет результат транскрипции по результату до все кайф вот и дополнительно к этому он еще создаст новые объекты это будет параллельная ветка то есть новый результат допустим то есть не не отчет отчет по существующим а будет еще новое а на следующей неделе я еще вот так вот блять ебану по смыслу по смыслу Пока не знаю, может быть по-разному Но скорее всего Отчет будет бизнесовый разделен Просто отчитайся, а теперь скажи, что ты планируешь Но может быть и такое, что он там что-то пиздит А вот сделали то-то, а вот собираемся сделать то-то И это идет в отчет Но ветка Следующая нода Следующий шаг Точнее воркера Говорит так, вот что пользователь напиздел Вот что мы извекли Но также пользователь упомянул Что на следующей неделе он хочет Еще вот такую-то херню ебануть Сбоку бантик Это будет записано в контексте И шаг воркера Итерация воркера По формированию планов на следующую неделю она смотрит в контекст который оставил предыдущий шаг а еще пользователь упоминал что он хочет новую хуйню заебенить сбоку бантик зачем это нужно чтобы не было такого что я ему говорю он забывает я ему говорю блять я ему 10 раз уже сказал а он не помнит то есть вот какой-то контекст между итерациями воркера, он будет сохраняться в задаче, в редисе, и переходить на следующий шаг.",
    "speaker" : "Vasily",
    "timestamp" : "54:04-56:24"
  },
  {
    "timestamp" : "54:30-54:31",
    "text" : "новые",
    "speaker" : "Speaker 12"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "54:40-54:51",
    "text" : "как он разделяет его но он фактически говорит вот это у нас отчет а вот это результат или он они зачетят результаты."
  },
  {
    "speaker" : "Speaker 2",
    "timestamp" : "55:30-55:30",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "55:41-55:42"
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "56:04-56:04"
  },
  {
    "speaker" : "Vasily",
    "text" : "Понимаешь, да?",
    "timestamp" : "56:28-56:29"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "56:31-56:39",
    "text" : "Я в целом как бы понимаю сейчас процесс. Давай вернемся назад. Я правильно понимаю, в схему?"
  },
  {
    "speaker" : "Vasily",
    "text" : "Да.",
    "timestamp" : "56:41-56:41"
  },
  {
    "text" : "Я правильно понимаю, что вот эта сейчас история, вот эта вся схема, это по сути целиковое решение, которое мы сейчас занимаемся. Оно самодостаточно в себе.",
    "timestamp" : "56:41-56:49",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "56:49-57:56",
    "speaker" : "Vasily",
    "text" : "смотри смотри важно разделять мы сейчас одновременно две задачи делаем точнее три задачи делаю которые вложены и взаимозависимы но отдельны по сути первая задача мы делаем task tracker для агентов универсальный комбайн в который закидываем описание бизнес-процессы он выполняет то есть вот мы следующем ну вот мы когда сделаем этот task tracker для агентов дальше мы сможем на верхнем уровне вот так вот описать что нужно сделать в табличном виде скормить нашей тузе и она пробегает по всем этим инструкциям выдает нужный результат это то есть первое это таск трекер для агентов. Второе это лента, которую мы в него закидываем."
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Speaker 2",
    "timestamp" : "57:18-57:18"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "57:30-57:30",
    "speaker" : "Speaker 2"
  },
  {
    "speaker" : "Speaker 14",
    "text" : "А сейчас то, что мы пилим этот процесс, он где?",
    "timestamp" : "57:46-57:48"
  },
  {
    "timestamp" : "57:59-58:14",
    "speaker" : "Vasily",
    "text" : "Мы делаем это на примере конкретного процесса для конкретного заказчика. Это третье. То есть есть конкретный заказчик, у которого несколько процессов, которые нужно загнать в агентов."
  },
  {
    "timestamp" : "58:15-58:44",
    "text" : "но вот первая история мы сейчас же первую пили flow этого тест трекера она где само по себе ну так и она состоит из этот бизнес процесс по сути мы и делаем сейчас правильно",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "Нет, мы пилим все одновременно. Просто task tracker для агентов на примере конкретной задачи.",
    "speaker" : "Vasily",
    "timestamp" : "58:18-58:26"
  },
  {
    "speaker" : "Vasily",
    "text" : "Flow task tracker.",
    "timestamp" : "58:33-58:34"
  },
  {
    "timestamp" : "58:35-58:37",
    "text" : "Смотри, вот это описание бизнес-процесса.",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "58:47-58:52",
    "text" : "Мы делаем хуевину, которая исполняет бизнес-процесс."
  },
  {
    "timestamp" : "58:54-58:56",
    "speaker" : "Speaker 14",
    "text" : "Ну, да, это same."
  },
  {
    "timestamp" : "58:55-59:19",
    "speaker" : "Vasily",
    "text" : "но в бизнес-процессе написано забей гвоздь закрути болт повесь полку вот для того чтобы он смог закрутить гвой закрутить забить гвоздь у него должен быть молоток для того чтобы закрутить шуруп у него должна быть отвертка для того чтобы повесить полку у него должен быть крепеж вот мы Мы сейчас даем ему молоток, даем ему отвертку и крепеж ему даем."
  },
  {
    "text" : "Но это сейчас процесс забивания гвоздя.",
    "speaker" : "Vasily",
    "timestamp" : "59:19-59:26"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Но у нас это соединено.",
    "timestamp" : "59:20-59:21"
  },
  {
    "text" : "То есть достань гвоздь из коробки с гвоздями.",
    "timestamp" : "59:26-59:29",
    "speaker" : "Vasily"
  },
  {
    "text" : "Возьми молоток в левую руку.",
    "speaker" : "Vasily",
    "timestamp" : "59:29-59:30"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "59:32-59:34",
    "text" : "Вот теперь, подожди, тут я понял."
  },
  {
    "speaker" : "Vasily",
    "text" : "Ёбни по гвоздю.",
    "timestamp" : "59:32-59:33"
  },
  {
    "timestamp" : "59:33-59:33",
    "speaker" : "Vasily",
    "text" : "Повторяй пока."
  },
  {
    "speaker" : "Vasily",
    "text" : "Да.",
    "timestamp" : "59:34-59:34"
  },
  {
    "timestamp" : "59:35-59:38",
    "speaker" : "Speaker 3",
    "text" : "Да, а вот теперь вернись к схеме, которую мы сегодня накидывали."
  },
  {
    "timestamp" : "59:39-59:39",
    "speaker" : "Vasily",
    "text" : "Да."
  },
  {
    "timestamp" : "59:40-59:41",
    "text" : "Это вот отражение ее.",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "59:42-59:59",
    "speaker" : "Vasily",
    "text" : "Вот, это как раз вот это вот молоток, это шуруп, это, блядь, способность ударить, это способность сказать, хозяин, я сделал."
  },
  {
    "text" : "Это взять следующий гвоздь или ударить следующий раз по гвоздю.",
    "speaker" : "Vasily",
    "timestamp" : "01:00:00-01:00:04"
  },
  {
    "text" : "фактически вот этот worker это и есть вся история все остальное то у нас контекст ну как бы не контекста вспомогательные утилиты всякие для связка все хорошо отлично сейчас немножечко чуть-чуть хотя бы понимание это вообще сложилось так назначить назначить назначить разрыв модель данных проектов бд мы сейчас то что я делаю это только отражение кода модель включает себе не только это она должна еще включать себя вот этот контекст тут кстати вопрос да смотри ты говорил про то что внутри воркера типа должно быть а вот тут вопрос с одной стороны может быть и да а с другой стороны могут быть их и ввать но это тоже в модель данных относится",
    "speaker" : "Speaker 3",
    "timestamp" : "01:00:07-01:01:09"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "01:00:12-01:01:05",
    "text" : "обвязка да да воркер это основное исполнение цикла и мы мы разрабатываем вот этого воркера на примере имеющихся задач это забить гвоздь давай да Смотри, это две разные базы данных."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "01:01:06-01:01:12",
    "text" : "У нас модель данных проекта – это клиентские данные."
  },
  {
    "text" : "А то, что я тебе сейчас показывал, это данные вот этой вот штуки.",
    "timestamp" : "01:01:14-01:01:19",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "01:01:19-01:01:20",
    "speaker" : "Speaker 5",
    "text" : "для процесса"
  },
  {
    "timestamp" : "01:01:20-01:01:24",
    "text" : "Да, они для процесса, для непосредственно таск-трекера.",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Vasily",
    "text" : "То есть вот таск-трекер, пользователь вообще про нее не знает.",
    "timestamp" : "01:01:25-01:01:29"
  },
  {
    "timestamp" : "01:01:29-01:01:30",
    "speaker" : "Vasily",
    "text" : "Ему поебать."
  },
  {
    "text" : "он даже отдаленно не представляет что у task tracker там что агент какие-то какие-то таски выполняет ну это его архитектура да соответственно да давай да смотри как это я как это будет реализовано создается задача и в нее записывается бизнес-процесс.",
    "speaker" : "Vasily",
    "timestamp" : "01:01:32-01:02:29"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "да я понимаю но это важно для самого воркера короче знаешь что я подумаю у нас тоже как бы гипотеза если у нас будет не один воркер в итоге но они будут работать с моделью данных своей как бы с одной может быть все таки надо иметь вне либо вне воркера потому что единый доступ либо если контекст постоянно меняется что кстати сомнительно потому что правило я так понимаю достаточно статичны будут в рамках исполнения Worker. То есть в момент, пока Worker работает, инструкции вероятно поменяются.",
    "timestamp" : "01:01:37-01:02:20"
  },
  {
    "text" : "В ходе жизни задачи бизнес-процесс не меняется.",
    "speaker" : "Vasily",
    "timestamp" : "01:02:30-01:02:33"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "01:02:35-01:02:42",
    "text" : "Контекст может меняться, потому что на разном шаге, ну, допустим, задача, не знаю, собрать с пользователя отчетность."
  },
  {
    "speaker" : "Speaker 2",
    "text" : "Mm-hmm.",
    "timestamp" : "01:02:40-01:02:40"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "01:02:43-01:02:44",
    "speaker" : "Speaker 2"
  },
  {
    "text" : "Пользователь рассказал что-то, нейросетка поняла, что он сказал, и поняла, что пользователь 30% нужного сказал.",
    "speaker" : "Vasily",
    "timestamp" : "01:02:44-01:02:52"
  },
  {
    "speaker" : "Vasily",
    "text" : "Она говорит, чувак, ты плохо отчитался Да Смотри, инструкции сейчас Хранятся в коде Почему? Потому что я их там пишу И с ними будет много экспериментов Когда мы настроим Их можно будет записать И они дальше не будут меняться Но период настройки Он может занимать Не знаю 10-20 итераций может произойти да сейчас он как делает сейчас на самом деле это очень просто реализовано task creator вот опять приходит сообщение появилась новое сообщение но сейчас task creator он реагирует на сообщение от пользователя появляет таблица messages в ней при insert нового сообщения триггерится вот этот workflow если сообщение является ответом на предыдущие она привязывает его к той задачи как коммент но мы сейчас обрабатываем ветку когда это новое сообщение кстати это нужно будет допилить пришло пришел пришло новое сообщение мы это определили по какой-то логике лезем в коду и там описание всех операций которые может агент совершить вот да он очень быстро лезет в коду там вообще прям хуйня он подтягивает вот эту вот таблицу вот вот эту таблицу подтягивает в которой есть название задачи и критерии выявления то есть пользователь говорит Ok.",
    "timestamp" : "01:02:53-01:05:58"
  },
  {
    "timestamp" : "01:02:55-01:03:11",
    "speaker" : "Speaker 3",
    "text" : "короче процесс процесс я пока данным слушай но вот смотри чтобы лишнего не таскать все таки может быть мы кстати с моделью данных такую же историю наверно будем делать вот модель данных пользовательская, она меняется чаще, чем инструкции."
  },
  {
    "text" : "И инструкции, наверное, имеет смысл хранить как-то тоже, то есть запрашивать один раз, хранить всю дорогу, потом их...",
    "timestamp" : "01:03:13-01:03:22",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 9",
    "text" : "Мне кажется, просто это узкое место.",
    "timestamp" : "01:03:41-01:03:42"
  },
  {
    "timestamp" : "01:03:45-01:03:47",
    "speaker" : "Speaker 9",
    "text" : "место производительности можно"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "01:04:49-01:04:49",
    "speaker" : "Speaker 2"
  },
  {
    "text" : "Ну ладно, давай сейчас не будем закапываться в эту история. Я в целом понял, как бы, процесс, сейчас, ну, немножко присобрался он. Давай сейчас тогда, ну, сейчас, у меня пока вопросов контекстно, ну, на данном этапе, наверное, больше сверху не будет, пока что.",
    "speaker" : "Speaker 3",
    "timestamp" : "01:05:42-01:05:58"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "01:05:59-01:06:08",
    "text" : "Давай сейчас поймем, то есть вот у меня сегодня и чуть-чуть завтра, частично завтра у меня план постараться закончить с синхронизалкой полностью."
  },
  {
    "timestamp" : "01:06:09-01:06:09",
    "speaker" : "Vasily",
    "text" : "De."
  },
  {
    "text" : "Я надеюсь, что сейчас я иду по true way, как бы, и там не будет, короче, у меня уже так много времени, сколько я потратил на то, чтобы въехать в эту историю.",
    "timestamp" : "01:06:09-01:06:19",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Vasily",
    "text" : "Ok.",
    "timestamp" : "01:06:19-01:06:19"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Соответственно, я рассчитываю, что сегодня и завтра утром я допилю эту историю.",
    "timestamp" : "01:06:22-01:06:28"
  },
  {
    "text" : "да да но я готов идеально было бы так же как сегодня Okay.",
    "timestamp" : "01:06:28-01:06:50",
    "speaker" : "Vasily"
  },
  {
    "text" : "Это все начнет работать. Завтра мы планировали с тобой созвониться. Во сколько это надо спланировать, во сколько бы.",
    "speaker" : "Speaker 3",
    "timestamp" : "01:06:30-01:06:37"
  },
  {
    "timestamp" : "01:06:46-01:07:42",
    "text" : "ну давай попробуем давай также сегодня попробуем вот и тогда и тогда и тогда и а вот но за то время как бы получается нам надо выделить историю ну или не за это или завтра надо выделить историю из воркера буду потом делать я вот я соответственно завтра у меня еще одна задача есть по другому проекту надо это же поделать и мне надо получается написать еще модуль вот это отправки сообщений что написать модуль отправки сообщениями надо вводные по нему будет и можно за автор в целом как бы ну что все не уже из лимита выходим просто замечать вот и мне надо по нему вводной по отправке. Я в целом что такое отправка в Telegram, я себе хорошо представляю. Мне надо понять, что мы будем отправлять, в каком виде, откуда.",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "01:07:24-01:07:27",
    "speaker" : "Vasily",
    "text" : "Est-ce que ça va?"
  },
  {
    "text" : "Угу.",
    "timestamp" : "01:07:40-01:07:41",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "01:07:43-01:07:51",
    "text" : "Flow как бы можно, ну, Subflow тоже можно сделать отдельный для него, чтобы у нас он, может быть, полифункциональный был."
  },
  {
    "timestamp" : "01:07:53-01:07:53",
    "speaker" : "Speaker 3",
    "text" : "Вот."
  },
  {
    "timestamp" : "01:07:55-01:07:55",
    "speaker" : "Speaker 3",
    "text" : "Но все равно."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Описание, короче, какое-то представление вообще нужно. Потому что самому просто отправить в Telegram, как бы, это история вроде не пыльная.",
    "timestamp" : "01:07:56-01:08:02"
  },
  {
    "text" : "Ну, если в двух словах, то в задаче записан контакт пользователя, с которым мы работаем.",
    "speaker" : "Vasily",
    "timestamp" : "01:08:01-01:08:06"
  },
  {
    "timestamp" : "01:08:09-01:08:10",
    "speaker" : "Speaker 15",
    "text" : "да это я помню"
  },
  {
    "text" : "И нужно взять из...",
    "speaker" : "Vasily",
    "timestamp" : "01:08:10-01:08:13"
  },
  {
    "speaker" : "Vasily",
    "text" : "Либо я это в задачи.",
    "timestamp" : "01:08:15-01:08:16"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "01:08:19-01:08:20",
    "text" : "Нужно продумать бизнес-логику."
  },
  {
    "timestamp" : "01:08:21-01:08:22",
    "speaker" : "Vasily",
    "text" : "То есть у нас есть задача."
  },
  {
    "timestamp" : "01:08:23-01:08:24",
    "speaker" : "Vasily",
    "text" : "Таблица задачи."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "01:08:25-01:08:26",
    "text" : "Есть сообщение."
  },
  {
    "speaker" : "Vasily",
    "text" : "Таблица сообщения.",
    "timestamp" : "01:08:26-01:08:27"
  },
  {
    "speaker" : "Vasily",
    "text" : "У сообщения есть признак in или out.",
    "timestamp" : "01:08:27-01:08:29"
  },
  {
    "timestamp" : "01:08:30-01:08:31",
    "text" : "Ну, in понятно.",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "01:08:31-01:08:34",
    "text" : "Мы обрабатываем, создаем задачу или комментим задачу.",
    "speaker" : "Vasily"
  },
  {
    "text" : "Out.",
    "timestamp" : "01:08:34-01:08:34",
    "speaker" : "Vasily"
  },
  {
    "speaker" : "Vasily",
    "text" : "Отправляем сообщение.",
    "timestamp" : "01:08:37-01:08:38"
  },
  {
    "speaker" : "Vasily",
    "text" : "Out сообщения должны также привязаться к conversation.",
    "timestamp" : "01:08:38-01:08:42"
  },
  {
    "timestamp" : "01:08:43-01:08:45",
    "speaker" : "Vasily",
    "text" : "Есть таблица диалоги."
  },
  {
    "timestamp" : "01:08:44-01:08:48",
    "text" : "У нас это в Кайзэ Инди, да?",
    "speaker" : "Speaker 8"
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "01:08:49-01:08:49",
    "text" : "Да."
  },
  {
    "timestamp" : "01:08:52-01:08:54",
    "speaker" : "Vasily",
    "text" : "Вот задействованы три таблицы."
  },
  {
    "timestamp" : "01:08:56-01:08:58",
    "text" : "Tasks, Messages и Conversations.",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "01:08:58-01:09:00",
    "text" : "Conversations просто для группировки сообщений.",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "01:09:06-01:09:15",
    "text" : "так ладно и мы и но у нас сообщение она в едином виде ли мы собираем Мы его из полей собираем?",
    "speaker" : "Speaker 3"
  },
  {
    "text" : "Я думаю, Worker будет формировать текст сообщения Да, должны быть кнопки Я думаю, знаешь должна быть кнопка тут точно должна быть кнопка пиздец чувак ты нихуя неправильно понял что я сказал или у меня есть правки вот какие сообщения могут прийти пользователю первое сообщение до первый тип сообщения отправь пожалуйста отчет это первичное сообщение давай давай я проговорю я потом тебе пришлю транскрипцию первичное сообщение запрос отчета чувак отчитайся 2 2 тип сообщения ты сказал я вот это записал я правильно тебя понял подтверждение 3 тип сообщения это это уточнение чувак ты про все рассказал а про поручение номер 10 не рассказал ничего или ты сказал но сроки не обновил то есть это до запроса информации это важно потому что нейросетка должна полноту контролировать она говорит так чувак смотри блять ты стандартизировать какие-то ответы я я на самом деле пока не знаю у меня было несколько кейсов она отправляет стандартизированную команду просто обратно да вот а дальше дальше мы должны не Ну там будет на какое сообщение она является реакцией.",
    "timestamp" : "01:09:13-01:11:48",
    "speaker" : "Vasily"
  },
  {
    "timestamp" : "01:09:18-01:09:23",
    "speaker" : "Speaker 3",
    "text" : "Хорошо, мы получаем какой-то текст, и у нас там какая-то, ты говорил, кнопка вроде как должна быть, да?"
  },
  {
    "timestamp" : "01:09:50-01:09:52",
    "text" : "Это она в какой момент возникает?",
    "speaker" : "Speaker 3"
  },
  {
    "timestamp" : "01:09:52-01:09:54",
    "speaker" : "Speaker 3",
    "text" : "в случае, когда ему пришло сообщение?"
  },
  {
    "timestamp" : "01:10:14-01:10:15",
    "text" : "Так, ладно, давай.",
    "speaker" : "Speaker 14"
  },
  {
    "timestamp" : "01:10:15-01:10:19",
    "speaker" : "Speaker 14",
    "text" : "Это, походу, сейчас будет у нас новый флоу начинается."
  },
  {
    "text" : "Ну, давай.",
    "timestamp" : "01:10:19-01:10:20",
    "speaker" : "Speaker 14"
  },
  {
    "text" : "Зачем нам кнопка?",
    "speaker" : "Speaker 3",
    "timestamp" : "01:11:10-01:11:11"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "01:11:11-01:11:14",
    "text" : "А кнопка, чтобы создавать контекст?"
  },
  {
    "timestamp" : "01:11:19-01:11:29",
    "speaker" : "Speaker 3",
    "text" : "для... Нет, слушай, мне кажется, как будто кнопка нам другого нужна. Короче, тут я бы потёр."
  },
  {
    "timestamp" : "01:11:29-01:12:06",
    "speaker" : "Speaker 3",
    "text" : "Кнопка же, ты понимаешь, как кнопка работает в телеге? Да, и больше ничего. То есть контекста контекста там не будет как бы в этот момент да да это будет давай короче это может завтра задачи покрутим эту историю потому что она не она не пятиминутка."
  },
  {
    "text" : "Соответственно, ну там что?",
    "speaker" : "Vasily",
    "timestamp" : "01:11:49-01:11:52"
  },
  {
    "timestamp" : "01:11:55-01:11:58",
    "speaker" : "Vasily",
    "text" : "Ну у меня были для других бизнес-процессов идеи вот этих кнопок."
  },
  {
    "speaker" : "Vasily",
    "timestamp" : "01:12:04-01:12:13",
    "text" : "Ну ладно, наверное, кнопка это не так сейчас критично, потому что ты умеешь их делать."
  },
  {
    "text" : "Мы уже, как бы, сегодня надали финалиться.",
    "timestamp" : "01:12:07-01:12:09",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "01:12:16-01:12:17",
    "text" : "На кнопке представляю."
  },
  {
    "timestamp" : "01:12:21-01:12:24",
    "speaker" : "Speaker 3",
    "text" : "Ладно, давай с сообщением я делаю синхронизатор."
  },
  {
    "text" : "Если завтра поймем, что допустим, мы можем немножко обсудить эту историю, нам просто надо стараться укладываться там час-дву-час-пятнадцать максимум.",
    "timestamp" : "01:12:24-01:12:32",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Vasily",
    "text" : "Хорошо Хорошо, давай сегодня вряд ли нет но есть помимо воркера другие штуки которые точно нужно допилить например вот эта приемка приемка сообщений создание задач вот там хорошо бы пилить кайф кайф окей давай на связи на покидываю *sweep* -",
    "timestamp" : "01:12:31-01:14:56"
  },
  {
    "timestamp" : "01:12:32-01:12:34",
    "speaker" : "Speaker 3",
    "text" : "Если немножко за тайминг вылезли."
  },
  {
    "speaker" : "Speaker 3",
    "timestamp" : "01:12:34-01:12:40",
    "text" : "И завтра тогда, может быть, мы выделим подзадачки в Worker."
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Ты уже немножечко, может быть, если ты сегодня будешь им заниматься?",
    "timestamp" : "01:12:40-01:12:44"
  },
  {
    "text" : "Я просто думаю, что классно было, чтобы ты уже, как бы, что-то чуть-чуть бы тронул бы в этой истории.",
    "speaker" : "Speaker 3",
    "timestamp" : "01:12:48-01:12:52"
  },
  {
    "timestamp" : "01:12:53-01:12:54",
    "speaker" : "Speaker 3",
    "text" : "Четче, может быть."
  },
  {
    "timestamp" : "01:12:58-01:12:58",
    "speaker" : "Speaker 3",
    "text" : "Ну, окей."
  },
  {
    "text" : "Давай тогда, как бы...",
    "speaker" : "Speaker 3",
    "timestamp" : "01:12:59-01:13:00"
  },
  {
    "speaker" : "Speaker 3",
    "text" : "Ну, хорошо, давай.",
    "timestamp" : "01:13:06-01:13:07"
  },
  {
    "timestamp" : "01:13:07-01:13:11",
    "text" : "Я синхронизатор, в общем, постараюсь до завтрашнего твоего утра доделать.",
    "speaker" : "Speaker 3"
  },
  {
    "speaker" : "Speaker 15",
    "timestamp" : "01:13:12-01:13:13",
    "text" : "Вот, я надеюсь, что все у меня для этого есть."
  },
  {
    "text" : "Уже теперь.",
    "timestamp" : "01:13:14-01:13:15",
    "speaker" : "Speaker 15"
  },
  {
    "text" : "И, ну и все.",
    "timestamp" : "01:13:16-01:13:18",
    "speaker" : "Speaker 2"
  },
  {
    "timestamp" : "01:13:18-01:13:21",
    "speaker" : "Speaker 15",
    "text" : "И завтра-то засинхронимся по следующей задачке."
  },
  {
    "timestamp" : "01:13:22-01:13:23",
    "speaker" : "Speaker 15",
    "text" : "Ну все, давай так."
  },
  {
    "timestamp" : "01:13:25-01:13:26",
    "text" : "Все, давай на связи.",
    "speaker" : "Speaker 15"
  },
  {
    "timestamp" : "01:13:27-01:13:27",
    "speaker" : "Speaker 15",
    "text" : "Пока."
  },
  {
    "speaker" : "Speaker 15",
    "text" : "them.",
    "timestamp" : "01:13:27-01:13:27"
  },
  {
    "speaker" : "Speaker 15",
    "timestamp" : "01:14:44-01:14:47",
    "text" : "Продолжение следует..."
  }
]